### List

In [2]:
countries = ['Pakistan', 'India', 'China']
population = [22.4, 43.67, 58.43]

In [3]:
ind = countries.index('India')
ind

1

In [4]:
population[ind]

43.67

In [5]:
world = {'Pakistan': 22.4, 'India': 43.67, 'China': 58.43}

In [6]:
world['China']

58.43

In [8]:
world_dict = {
    "countries": ['Pakistan', 'India', 'China'],
    "population": [22.4, 43.67, 58.43]
}

In [13]:
world_dict

{'countries': ['Pakistan', 'India', 'China'],
 'population': [22.4, 43.67, 58.43]}

In [10]:
world_dict['countries'][1]

'India'

In [11]:
import pandas as pd

In [59]:
df = pd.DataFrame(world_dict)
df.head(2)

  countries  population
0  Pakistan       22.40
1     India       43.67

In [17]:
print(type(df), type(df['population']))

<class 'pandas.core.frame.DataFrame'> <class 'pandas.core.series.Series'>

In [18]:
df.countries

0    Pakistan
1       India
2       China
Name: countries, dtype: object

In [19]:
df.shape

(3, 2)

In [20]:
df.columns

Index(['countries', 'population'], dtype='object')

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   countries   3 non-null      object
 1   population  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

In [23]:
df.describe()

       population
count    3.000000
mean    41.500000
std     18.112755
min     22.400000
25%     33.035000
50%     43.670000
75%     51.050000
max     58.430000

In [24]:
df

  countries  population
0  Pakistan       22.40
1     India       43.67
2     China       58.43

In [25]:
df.rename(columns={"population": 'pop'})

  countries    pop
0  Pakistan  22.40
1     India  43.67
2     China  58.43

In [26]:
df

  countries  population
0  Pakistan       22.40
1     India       43.67
2     China       58.43

In [27]:
df = df.rename(columns={"population": 'pop'})

In [28]:
df

  countries    pop
0  Pakistan  22.40
1     India  43.67
2     China  58.43

In [29]:
df.rename(columns={"pop": 'population'}, inplace=True)

In [30]:
df

  countries  population
0  Pakistan       22.40
1     India       43.67
2     China       58.43

In [31]:
df.index = ['PK', 'IN', 'CH']

In [32]:
df

   countries  population
PK  Pakistan       22.40
IN     India       43.67
CH     China       58.43

In [40]:
df.rename(columns={'countries': 'count', 'population': 'pop', 'cities': 'city'})

      count    pop
0  Pakistan  22.40
1     India  43.67
2     China  58.43

In [41]:
df.rename(columns={'countries': 'count', 'population': 'pop', 'cities': 'city'}, errors='raise')

KeyError: "['cities'] not found in axis"

In [34]:
df

   countries  population
PK  Pakistan       22.40
IN     India       43.67
CH     China       58.43

In [42]:
df = pd.DataFrame({"A": [1, 2], "B": [3, 4]})

# Renaming columns and creating a new DataFrame (default behavior)
new_df = df.rename(columns={"A": "Column_A_New"})
print("Original DataFrame:")
print(df)
print("\nNew DataFrame after rename:")
print(new_df)

Original DataFrame:
   A  B
0  1  3
1  2  4

New DataFrame after rename:
   Column_A_New  B
0             1  3
1             2  4

In [43]:
new_df.loc[0, 'Column_A_New'] = 99
print("\nNew DataFrame after modification:")
print(new_df)
print("\nOriginal DataFrame (should be unchanged):")
print(df)

New DataFrame after modification:
   Column_A_New  B
0            99  3
1             2  4

Original DataFrame (should be unchanged):
   A  B
0  1  3
1  2  4

In [44]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
# The rename with copy=False creates a new df_renamed object,
# but shares the same underlying data as df.
df_renamed = df.rename(columns={'A': 'C'}, copy=False)

# Modifying the data through the renamed DataFrame would also modify the original.
df_renamed.iloc[0, 0] = 999

# In older pandas, this would print 999 in both DataFrames.
print("Original df (pre-CoW behavior):\n", df)
print("\nRenamed df (pre-CoW behavior):\n", df_renamed)

Original df (pre-CoW behavior):
      A  B
0  999  4
1    2  5
2    3  6

Renamed df (pre-CoW behavior):
      C  B
0  999  4
1    2  5
2    3  6

In [45]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

In [46]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [55]:
new_df = df1.rename(columns={'A': 'C'}, copy=False)

In [56]:
new_df.iloc[0, 0] = 999

In [57]:
new_df

     C  B
0  999  4
1    2  5
2    3  6

In [58]:
df1

     A  B
0  999  4
1    2  5
2    3  6

In [60]:
df['countries']

  countries  population
0  Pakistan       22.40
1     India       43.67
2     China       58.43

In [62]:
df.isnull()

   countries  population
0      False       False
1      False       False
2      False       False